---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsSupportOverlapFailure
source: html/f288162b-bf1d-43b5-2103-a31b4f5d1ca6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsSupportOverlapFailure Property

Some supports overlap with others

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsSupportOverlapFailure { get; }
```